HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/verticalChannelLTS/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.00379;
        rhoInlet        1.0;    // fallback value for e.g. potentialFoam
    }
    inletSides
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.00832;
        rhoInlet        1.0;    // fallback value for e.g. potentialFoam
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
