HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/verticalChannelLTS/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-9;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.15;
        value           uniform 3.75e-9;
    }
    inletSides
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.16;
        value           uniform 3.75e-9;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-9;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
