HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/verticalChannelLTS/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    inletCentral
    {
        type            zeroGradient;
    }

    inletSides
    {
        type            zeroGradient;
    }

    outlet
    {
        type            prghPressure;
        p               uniform 100000;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
