HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/verticalChannelLTS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|.*Final)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        smoother         DICGaussSeidel;

        tolerance        1e-6;
        relTol           0.05;

        maxIter          50;
    };

    p_rghFinal
    {
        $p_rgh;
    }

    Phi
    {
        $p_rgh;
    }

    "(U|Yi|h|k|omega|.*Final)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
        maxIter         20;
    }
}

potentialFlow
{
    // Used for potentialFoam initialisation
    nNonOrthogonalCorrectors 5;
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor   yes;

    pMaxFactor          1.5;
    pMinFactor          0.9;

    maxCo           2.5;
    rDeltaTSmoothingCoeff 0.5;
    alphaTemp       1;
    maxDeltaT       1;
}

// ************************************************************************* //
